Tekla Open API Reference for Tekla Structures 2025
DataGrid Constructor
 Initializes a new instance of the DataGrid class.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DataGrid()
Public Sub New
See Also
Reference
DataGrid Class
Tekla.Structures.Dialog.UIControls Namespace